results/2018-05-05_17-05-42/post-1k/jetty-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 0.989ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.977ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.963ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.98ms  430.89us   8.30ms   66.31%
    Req/Sec   172.17     96.65   777.00     73.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.29ms
 90.000%    1.47ms
 99.000%    2.01ms
 99.900%    2.25ms
 99.990%    4.35ms
 99.999%    5.42ms
100.000%    8.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.155     0.000000            1         1.00
       0.370     0.100000       540471         1.11
       0.545     0.200000      1081022         1.25
       0.721     0.300000      1620539         1.43
       0.879     0.400000      2158834         1.67
       1.018     0.500000      2699088         2.00
       1.079     0.550000      2969044         2.22
       1.134     0.600000      3236924         2.50
       1.186     0.650000      3507882         2.86
       1.237     0.700000      3780251         3.33
       1.288     0.750000      4049688         4.00
       1.313     0.775000      4181624         4.44
       1.340     0.800000      4319422         5.00
       1.367     0.825000      4454114         5.71
       1.394     0.850000      4587230         6.67
       1.425     0.875000      4723341         8.00
       1.445     0.887500      4789310         8.89
       1.471     0.900000      4857205        10.00
       1.506     0.912500      4923997        11.43
       1.554     0.925000      4991163        13.33
       1.611     0.937500      5057913        16.00
       1.644     0.943750      5091836        17.78
       1.679     0.950000      5125262        20.00
       1.716     0.956250      5159075        22.86
       1.756     0.962500      5192701        26.67
       1.800     0.968750      5226178        32.00
       1.824     0.971875      5243011        35.56
       1.849     0.975000      5259810        40.00
       1.876     0.978125      5276885        45.71
       1.905     0.981250      5293549        53.33
       1.939     0.984375      5310544        64.00
       1.957     0.985938      5318937        71.11
       1.976     0.987500      5327318        80.00
       1.997     0.989062      5335908        91.43
       2.019     0.990625      5344218       106.67
       2.044     0.992188      5352514       128.00
       2.059     0.992969      5356908       142.22
       2.075     0.993750      5360991       160.00
       2.093     0.994531      5365261       182.86
       2.111     0.995313      5369330       213.33
       2.133     0.996094      5373834       256.00
       2.143     0.996484      5375781       284.44
       2.155     0.996875      5377972       320.00
       2.167     0.997266      5379929       365.71
       2.181     0.997656      5382087       426.67
       2.195     0.998047      5384093       512.00
       2.203     0.998242      5385119       568.89
       2.213     0.998437      5386238       640.00
       2.223     0.998633      5387278       731.43
       2.235     0.998828      5388317       853.33
       2.249     0.999023      5389337      1024.00
       2.257     0.999121      5389871      1137.78
       2.267     0.999219      5390442      1280.00
       2.277     0.999316      5390929      1462.86
       2.291     0.999414      5391438      1706.67
       2.307     0.999512      5391927      2048.00
       2.319     0.999561      5392236      2275.56
       2.331     0.999609      5392456      2560.00
       2.351     0.999658      5392716      2925.71
       2.383     0.999707      5392985      3413.33
       2.457     0.999756      5393241      4096.00
       2.591     0.999780      5393373      4551.11
       3.203     0.999805      5393505      5120.00
       3.617     0.999829      5393637      5851.43
       3.907     0.999854      5393768      6826.67
       4.155     0.999878      5393903      8192.00
       4.251     0.999890      5393967      9102.22
       4.363     0.999902      5394032     10240.00
       4.447     0.999915      5394098     11702.86
       4.571     0.999927      5394166     13653.33
       4.675     0.999939      5394229     16384.00
       4.731     0.999945      5394264     18204.44
       4.795     0.999951      5394295     20480.00
       4.867     0.999957      5394328     23405.71
       4.919     0.999963      5394363     27306.67
       4.991     0.999969      5394394     32768.00
       5.035     0.999973      5394410     36408.89
       5.091     0.999976      5394427     40960.00
       5.131     0.999979      5394445     46811.43
       5.187     0.999982      5394460     54613.33
       5.239     0.999985      5394476     65536.00
       5.287     0.999986      5394484     72817.78
       5.347     0.999988      5394493     81920.00
       5.391     0.999989      5394501     93622.86
       5.447     0.999991      5394509    109226.67
       5.479     0.999992      5394517    131072.00
       5.523     0.999993      5394521    145635.56
       5.595     0.999994      5394526    163840.00
       5.647     0.999995      5394530    187245.71
       5.711     0.999995      5394534    218453.33
       5.775     0.999996      5394538    262144.00
       5.795     0.999997      5394540    291271.11
       5.823     0.999997      5394542    327680.00
       5.919     0.999997      5394544    374491.43
       5.999     0.999998      5394547    436906.67
       6.035     0.999998      5394548    524288.00
       6.071     0.999998      5394549    582542.22
       6.167     0.999998      5394550    655360.00
       6.255     0.999999      5394551    748982.86
       6.659     0.999999      5394552    873813.33
       6.923     0.999999      5394553   1048576.00
       7.351     0.999999      5394554   1165084.44
       7.351     0.999999      5394554   1310720.00
       7.523     0.999999      5394555   1497965.71
       7.523     0.999999      5394555   1747626.67
       7.711     1.000000      5394556   2097152.00
       7.711     1.000000      5394556   2330168.89
       7.711     1.000000      5394556   2621440.00
       8.163     1.000000      5394557   2995931.43
       8.163     1.000000      5394557   3495253.33
       8.163     1.000000      5394557   4194304.00
       8.163     1.000000      5394557   4660337.78
       8.163     1.000000      5394557   5242880.00
       8.303     1.000000      5394558   5991862.86
       8.303     1.000000      5394558          inf
#[Mean    =        0.980, StdDeviation   =        0.431]
#[Max     =        8.296, Total count    =      5394558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400039 requests in 180.00m, 607.69MB read
Requests/sec:    500.00
Transfer/sec:     57.62KB